In [1]:
print("Hello world")

Hello world

In [2]:
#Create a data frame
raw_data = {'first _name':['Sam','Ziva','Kia','Robin'],'degree':['phd','MBA','M tech','B tech'], 'age':[25,34,43,34]}
import pandas as pd
df = pd.DataFrame(raw_data)
print(df)

  first _name  degree  age
0         Sam     phd   25
1        Ziva     MBA   34
2         Kia  M tech   43
3       Robin  B tech   34

In [ ]:
df.to_csv(r"Example.csv")

In [3]:
df.to_csv(r"Example.csv")

In [4]:
df=pd.read_csv("Example.csv")
print(df)

   Unnamed: 0 first _name  degree  age
0           0         Sam     phd   25
1           1        Ziva     MBA   34
2           2         Kia  M tech   43
3           3       Robin  B tech   34

In [5]:
df.head()

   Unnamed: 0 first _name  degree  age
0           0         Sam     phd   25
1           1        Ziva     MBA   34
2           2         Kia  M tech   43
3           3       Robin  B tech   34

In [6]:
df.head(2)

   Unnamed: 0 first _name degree  age
0           0         Sam    phd   25
1           1        Ziva    MBA   34

In [7]:
del df['Unnamed: 0']

In [8]:
df

  first _name  degree  age
0         Sam     phd   25
1        Ziva     MBA   34
2         Kia  M tech   43
3       Robin  B tech   34

In [9]:
df.describe()

             age
count   4.000000
mean   34.000000
std     7.348469
min    25.000000
25%    31.750000
50%    34.000000
75%    36.250000
max    43.000000

In [10]:
import numpy as np
d = {'A':[1,2,np.NaN],'B':[1,np.Nan,np.NaN]}
df = pd.DataFrame(d)
df

AttributeError: module 'numpy' has no attribute 'Nan'

In [11]:
import numpy as np
d = {'A':[1,2,np.NaN],'B':[1,np.NaN,np.NaN]}
df = pd.DataFrame(d)
df

     A    B
0  1.0  1.0
1  2.0  NaN
2  NaN  NaN

In [12]:
df1= df.dropna()
df1

     A    B
0  1.0  1.0

In [14]:
newdf=df.fillna('Ab')
newdf

     A    B
0  1.0  1.0
1  2.0   Ab
2   Ab   Ab

In [1]:
import pandas as pd
df=pd.DataFrame({'one':[20,10,1000,20,40],'two':[2000,20,90,3,9]})
print(df)
print(df.replace({1000:10,2000:20}))

    one   two
0    20  2000
1    10    20
2  1000    90
3    20     3
4    40     9
   one  two
0   20   20
1   10   20
2   10   90
3   20    3
4   40    9

In [2]:
mylist=[[1,2,3],[4,5,6],[7,8,9]]
mylist

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [3]:
import numpy as np
ar1=np.array(mylist)
ar1

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [4]:
a1=np.random.rand(5)
a1

array([0.93102441, 0.43803014, 0.28445414, 0.67362792, 0.94261091])